; domain
(define (domain kitting-domain)
	(:requirements :strips :typing)
	(:types 
		VacuumEffectorSingleCup
		EndEffectorHolder 
		Kit 
		KitTray
		LargeBoxWithEmptyKitTrays 
		LargeBoxWithKits
		Part 
		PartsTray 
		Robot 
		WorkTable)

	(:predicates
	
	;TRUE iff eff is attached to r
	(eff-location ?eff - VacuumEffectorSingleCup ?r - Robot)	
		
	;TRUE iff eff is in effh		
	(eff-location ?eff - VacuumEffectorSingleCup ?effholder - EndEffectorHolder)

	;TRUE iff r is equipped with eff
	(r-with-eff ?r - Robot ?eff - VacuumEffectorSingleCup)				
		
	;TRUE iff r is not equipped with any end effector
	(r-no-eff ?r - Robot)						
		
	;TRUE iff kins is on wtable		
	(onworktable ?wtable - WorkTable ?kit - Kit)
		
	;TRUE iff kt is on wtable
	(onworktable ?wtable - WorkTable ?kt - KitTray)	
	
	;TRUE iff there is nothing on wtable
	(worktable-empty ?wtable - WorkTable)
	
	;TRUE iff kins is in lbwk
	(kit-location ?kit - Kit ?lbwk - LargeBoxWithKits)		
	
	;TRUE iff kins is on wtable
	(kit-location ?kit - Kit ?wtable - WorkTable)	
	
	;TRUE iff kins is being held by r
	(kit-location ?kit - Kit ?r - Robot)				
	
	;TRUE iff kt is in lbwekt				
	(kit-tray-location ?kt - KitTray ?lbwekt - LargeBoxWithEmptyKitTrays)	

	;TRUE iff kt is being held by r
	(kit-tray-location ?kt - KitTray ?r - Robot)					
		
	;TRUE iff kt is on wtable
	(kit-tray-location ?kt - KitTray ?wtable - WorkTable)
	
	;TRUE iff p is in pt
	(part-location ?p - Part ?pt - PartsTray)					
	
	;TRUE iff p is in kins
	(part-location ?p - Part ?kit - Kit)			
		
	;TRUE iff p is being held by r
	(part-location ?p - Part ?r - Robot)	

	;TRUE iff r is holding kt						
	(rhold ?r - Robot ?kt - KitTray)	

	;TRUE iff r is holding kins					
	(rhold ?r - Robot ?kit - Kit)				
		
	;TRUE iff r is holding p
	(rhold ?r - Robot ?p - Part)					
			
	;TRUE iff r is not holding anything
	(rhold-empty ?r - Robot)							
			
	;TRUE iff lbwk is not full
	(lbwk-not-full ?lbwk - LargeBoxWithKits)
		
	;TRUE iff lbwekt is not empty
	(lbwekt-not-empty ?lbwekt - LargeBoxWithEmptyKitTrays)	
	
	;TRUE iff ?pt is not empty		
	(part-tray-not-empty ?pt - PartsTray)
	
	;TRUE iff eff is capable of holding ?kt						
	(efftype ?eff - VacuumEffectorSingleCup ?kt - KitTray)
	
	;TRUE iff eff is capable of holding ?kit
	(efftype ?eff - VacuumEffectorSingleCup ?kit - Kit)	
	
	;TRUE iff eff is capable of holding ?p
	(efftype ?eff - VacuumEffectorSingleCup ?p - Part)

	;TRUE iff ?effholder is holding eff				
	(effhhold-eff ?effholder - EndEffectorHolder ?eff - VacuumEffectorSingleCup)	

	;TRUE iff ?effholder is empty (?effholder holds no end-effector)		
	(effh-empty ?effholder - EndEffectorHolder)	
    )
   
	(:action take-kit-tray
		:parameters(
			?r - Robot 
			?kt - KitTray 
			?lbwekt - LargeBoxWithEmptyKitTrays 
			?eff - VacuumEffectorSingleCup 
			?wtable - WorkTable)
		:precondition(and 
			(rhold-empty ?r) 
			(lbwekt-not-empty ?lbwekt)
			(r-with-eff ?r ?eff) 
			(kit-tray-location ?kt ?lbwekt) 
			(eff-location ?eff ?r)
			(worktable-empty ?wtable)
			(efftype ?eff ?kt))
		:effect(and 
			(rhold ?r ?kt) 
			(kit-tray-location ?kt ?r) 
			(not (rhold-empty ?r)) 
			(not (kit-tray-location ?kt ?lbwekt))))
			
	(:action put-kit-tray
		:parameters(
			?r - Robot 
			?kt - KitTray 
			?wtable - WorkTable)
		:precondition 
			(and  
			(kit-tray-location ?kt ?r) 
			(rhold ?r ?kt) 
			(worktable-empty ?wtable))
		:effect(and 
			(not(kit-tray-location ?kt ?r)) 
			(not(rhold ?r ?kt)) 
			(not(worktable-empty ?wtable)) 
			(kit-tray-location ?kt ?wtable) 
			(rhold-empty ?r) 
			(onworktable ?wtable ?kt))
	)

	(:action take-kit
		:parameters(
			?r - Robot 
			?kit - Kit 
			?wtable - WorkTable 
			?eff - VacuumEffectorSingleCup)
		:precondition 
			(and  
			(kit-location ?kit ?wtable) 
			(rhold-empty ?r) 
			(onworktable ?wtable ?kit) 
			(r-with-eff ?r ?eff)
			(efftype ?eff ?kit))
		:effect 
			(and 
			(kit-location ?kit ?r) 
			(rhold ?r ?kit) 
			(worktable-empty ?wtable) 
			(not (kit-location ?kit ?wtable)) 
			(not (rhold-empty ?r))
			(not(onworktable ?wtable ?kit)))
	)
			
	(:action put-kit
		:parameters(
			?r - Robot 
			?kit - Kit 
			?lbwk - LargeBoxWithKits)
		
		:precondition 
			(and  
			(kit-location ?kit ?r) 
			(rhold ?r ?kit) 
			(lbwk-not-full ?lbwk))
		:effect 
			(and  
			(kit-location ?kit ?lbwk) 
			(rhold-empty ?r)
			(not (kit-location ?kit ?r))
			(not (rhold ?r ?kit)))
	)
			
	(:action take-part
		:parameters(
			?r - Robot 
			?part - Part 
			?pt - PartsTray 
			?eff - VacuumEffectorSingleCup 
			?wtable - WorkTable 
			?kit - Kit)
		:precondition 
			(and  
			(part-location ?part ?pt) 
			(eff-location ?eff ?r) 
			(rhold-empty ?r) 
			(r-with-eff ?r ?eff) 
			(onworktable ?wtable ?kit) 
			(kit-location ?kit ?wtable)
			(efftype ?eff ?part)
			(part-tray-not-empty ?pt))
		:effect 
			(and  
			(part-location ?part ?r) 
			(rhold ?r ?part)
			(not (part-location ?part ?pt))
			(not (rhold-empty ?r)))
	)
			
	(:action put-part
		:parameters(
			?r - Robot 
			?p - Part 
			?kit - Kit  
			?wtable - WorkTable)
		:precondition 
			(and  
			(part-location ?p ?r) 
			(rhold ?r ?p) 
			(onworktable ?wtable ?kit)
			(kit-location ?kit ?wtable))
		:effect 
			(and  
			(not (part-location ?p ?r))
			(not (rhold ?r ?p))
			(part-location ?p ?kit) 
			(rhold-empty ?r))
	)
			
	(:action attach-eff
		:parameters(
			?r - Robot 
			?eff - VacuumEffectorSingleCup 
			?effholder - EndEffectorHolder)
		:precondition 
			(and  
			(eff-location ?eff ?effholder) 		
			(r-no-eff ?r)				
			(effhhold-eff  ?effholder ?eff)	
			(not (effh-empty ?effholder)))		
		:effect 
			(and  
			(rhold-empty ?r)			
			(eff-location ?eff ?r) 			
			(r-with-eff ?r ?eff)			
			(not (eff-location ?eff ?effholder)) 	
			(not (effhhold-eff ?effholder ?eff)) 	
			(not (r-no-eff ?r))			
			(effh-empty ?effholder))		
	)
	
	(:action remove-eff
		:parameters(
			?r - Robot 
			?eff - VacuumEffectorSingleCup 
			?effholder - EndEffectorHolder)
		:precondition 
			(and  
			(eff-location ?eff ?r) 
			(r-with-eff ?r ?eff) 
			(rhold-empty ?r)
			(effh-empty ?effholder))
		:effect 
			(and
			(not(eff-location ?eff ?r))
			(not(r-with-eff ?r ?eff))
			(eff-location ?eff ?effholder)
			(effhhold-eff  ?effholder ?eff)
			(r-no-eff ?r)
			(not(effh-empty ?effholder)))
	)
			
	(:action create-kit
		:parameters(
			?kit - Kit 
			?kt - KitTray 
			?wtable - WorkTable)
		:precondition 
			(onworktable ?wtable ?kt)
		:effect 
			(and 
			(not(onworktable ?wtable ?kt)) 
			(onworktable ?wtable ?kit) 
			(kit-location ?kit ?wtable))
	)
)

; problem
(define (problem kitting-problem)
	(:domain kitting-domain)
	(:objects
		robot_1 - Robot
		kit_tray_1 - KitTray
		kit_a2b2c1 - Kit
		empty_kit_tray_supply - LargeBoxWithEmptyKitTrays
		finished_kit_receiver - LargeBoxWithKits 
		work_table_1 - WorkTable
		part_a_tray part_b_tray part_c_tray - PartsTray
		part_a_1 part_a_2 part_b_1 part_b_2 part_c_1 - Part 
		part_gripper tray_gripper - VacuumEffectorSingleCup
		part_gripper_holder tray_gripper_holder - EndEffectorHolder
	)


	(:init
		(r-no-eff robot_1)			
		(lbwekt-not-empty empty_kit_tray_supply)	
		(lbwk-not-full finished_kit_receiver)		
		(part-tray-not-empty part_a_tray)
		(part-tray-not-empty part_b_tray) 
		(part-tray-not-empty part_c_tray)
		(eff-location part_gripper part_gripper_holder)
		(eff-location tray_gripper tray_gripper_holder) 
		(effhhold-eff part_gripper_holder part_gripper)
		(effhhold-eff tray_gripper_holder tray_gripper)
		(worktable-empty work_table_1) 
		(part-location part_a_1 part_a_tray)
		(part-location part_a_2 part_a_tray) 
		(part-location part_b_1 part_b_tray)
		(part-location part_b_2 part_b_tray)
		(part-location part_c_1 part_c_tray) 
		(kit-tray-location kit_tray_1 empty_kit_tray_supply)
		(efftype part_gripper part_a_1)
		(efftype part_gripper part_a_2)
		(efftype part_gripper part_b_1)
		(efftype part_gripper part_b_2)
		(efftype part_gripper part_c_1)
		(efftype tray_gripper kit_tray_1)
		(efftype tray_gripper kit_a2b2c1)
		;not(effh-empty part_gripper_holder)
		;not(effh-empty tray_gripper_holder)
	)
	
	
	(:goal
	  (and  
	    (part-location part_a_1 kit_a2b2c1) 
	    (part-location part_a_2 kit_a2b2c1) 
	    (part-location part_b_1 kit_a2b2c1)
	    (part-location part_b_2 kit_a2b2c1) 
	    (part-location part_c_1 kit_a2b2c1) 
	    (kit-location kit_a2b2c1 finished_kit_receiver)
	   )
	)
)

; plan
1. (attach-eff robot_1 tray_gripper tray_gripper_holder)
   deleted: (eff-location tray_gripper tray_gripper_holder) (effhhold-eff tray_gripper_holder tray_gripper) (r-no-eff robot_1)
   added: (rhold-empty robot_1) (eff-location tray_gripper robot_1) (r-with-eff robot_1 tray_gripper) (effh-empty tray_gripper_holder)
   goals met: 0 of 6
2. (take-kit-tray robot_1 kit_tray_1 empty_kit_tray_supply tray_gripper work_table_1)
   deleted: (rhold-empty robot_1) (kit-tray-location kit_tray_1 empty_kit_tray_supply)
   added: (rhold robot_1 kit_tray_1) (kit-tray-location kit_tray_1 robot_1)
   goals met: 0 of 6
3. (put-kit-tray robot_1 kit_tray_1 work_table_1)
   deleted: (kit-tray-location kit_tray_1 robot_1) (rhold robot_1 kit_tray_1) (worktable-empty work_table_1)
   added: (kit-tray-location kit_tray_1 work_table_1) (rhold-empty robot_1) (onworktable work_table_1 kit_tray_1)
   goals met: 0 of 6
4. (create-kit kit_a2b2c1 kit_tray_1 work_table_1)
   deleted: (onworktable work_table_1 kit_tray_1)
   added: (onworktable work_table_1 kit_a2b2c1) (kit-location kit_a2b2c1 work_table_1)
   goals met: 0 of 6
5. (remove-eff robot_1 tray_gripper tray_gripper_holder)
   deleted: (eff-location tray_gripper robot_1) (r-with-eff robot_1 tray_gripper) (effh-empty tray_gripper_holder)
   added: (eff-location tray_gripper tray_gripper_holder) (effhhold-eff tray_gripper_holder tray_gripper) (r-no-eff robot_1)
   goals met: 0 of 6
6. (attach-eff robot_1 part_gripper part_gripper_holder)
   deleted: (eff-location part_gripper part_gripper_holder) (effhhold-eff part_gripper_holder part_gripper) (r-no-eff robot_1)
   added: (eff-location part_gripper robot_1) (r-with-eff robot_1 part_gripper) (effh-empty part_gripper_holder)
   goals met: 0 of 6
7. (take-part robot_1 part_b_1 part_b_tray part_gripper work_table_1 kit_a2b2c1)
   deleted: (part-location part_b_1 part_b_tray) (rhold-empty robot_1)
   added: (part-location part_b_1 robot_1) (rhold robot_1 part_b_1)
   goals met: 0 of 6
8. (put-part robot_1 part_b_1 kit_a2b2c1 work_table_1)
   deleted: (part-location part_b_1 robot_1) (rhold robot_1 part_b_1)
   added: (part-location part_b_1 kit_a2b2c1) (rhold-empty robot_1)
   goals met: 1 of 6
9. (take-part robot_1 part_a_1 part_a_tray part_gripper work_table_1 kit_a2b2c1)
   deleted: (part-location part_a_1 part_a_tray) (rhold-empty robot_1)
   added: (part-location part_a_1 robot_1) (rhold robot_1 part_a_1)
   goals met: 1 of 6
10. (put-part robot_1 part_a_1 kit_a2b2c1 work_table_1)
   deleted: (part-location part_a_1 robot_1) (rhold robot_1 part_a_1)
   added: (part-location part_a_1 kit_a2b2c1) (rhold-empty robot_1)
   goals met: 2 of 6
11. (take-part robot_1 part_a_2 part_a_tray part_gripper work_table_1 kit_a2b2c1)
   deleted: (part-location part_a_2 part_a_tray) (rhold-empty robot_1)
   added: (part-location part_a_2 robot_1) (rhold robot_1 part_a_2)
   goals met: 2 of 6
12. (put-part robot_1 part_a_2 kit_a2b2c1 work_table_1)
   deleted: (part-location part_a_2 robot_1) (rhold robot_1 part_a_2)
   added: (part-location part_a_2 kit_a2b2c1) (rhold-empty robot_1)
   goals met: 3 of 6
13. (take-part robot_1 part_b_2 part_b_tray part_gripper work_table_1 kit_a2b2c1)
   deleted: (part-location part_b_2 part_b_tray) (rhold-empty robot_1)
   added: (part-location part_b_2 robot_1) (rhold robot_1 part_b_2)
   goals met: 3 of 6
14. (put-part robot_1 part_b_2 kit_a2b2c1 work_table_1)
   deleted: (part-location part_b_2 robot_1) (rhold robot_1 part_b_2)
   added: (part-location part_b_2 kit_a2b2c1) (rhold-empty robot_1)
   goals met: 4 of 6
15. (take-part robot_1 part_c_1 part_c_tray part_gripper work_table_1 kit_a2b2c1)
   deleted: (part-location part_c_1 part_c_tray) (rhold-empty robot_1)
   added: (part-location part_c_1 robot_1) (rhold robot_1 part_c_1)
   goals met: 4 of 6
16. (put-part robot_1 part_c_1 kit_a2b2c1 work_table_1)
   deleted: (part-location part_c_1 robot_1) (rhold robot_1 part_c_1)
   added: (part-location part_c_1 kit_a2b2c1) (rhold-empty robot_1)
   goals met: 5 of 6
17. (remove-eff robot_1 part_gripper part_gripper_holder)
   deleted: (eff-location part_gripper robot_1) (r-with-eff robot_1 part_gripper) (effh-empty part_gripper_holder)
   added: (eff-location part_gripper part_gripper_holder) (effhhold-eff part_gripper_holder part_gripper) (r-no-eff robot_1)
   goals met: 5 of 6
18. (attach-eff robot_1 tray_gripper tray_gripper_holder)
   deleted: (eff-location tray_gripper tray_gripper_holder) (effhhold-eff tray_gripper_holder tray_gripper) (r-no-eff robot_1)
   added: (eff-location tray_gripper robot_1) (r-with-eff robot_1 tray_gripper) (effh-empty tray_gripper_holder)
   goals met: 5 of 6
19. (take-kit robot_1 kit_a2b2c1 work_table_1 tray_gripper)
   deleted: (kit-location kit_a2b2c1 work_table_1) (rhold-empty robot_1) (onworktable work_table_1 kit_a2b2c1)
   added: (kit-location kit_a2b2c1 robot_1) (rhold robot_1 kit_a2b2c1) (worktable-empty work_table_1)
   goals met: 5 of 6
20. (put-kit robot_1 kit_a2b2c1 finished_kit_receiver)
   deleted: (kit-location kit_a2b2c1 robot_1) (rhold robot_1 kit_a2b2c1)
   added: (kit-location kit_a2b2c1 finished_kit_receiver) (rhold-empty robot_1)
   goals met: 6 of 6
